app/controllers/api/v1/category_controller.rb

    def update
        update_request = CategoryUpdateRequest.new(category_params)
        if update_request.valid?
            update_category = @category_repo.update_by_uid(params[:uid], category_params)
---
UPDATE "categories" SET "updated_at" = $1, "name" = $2, "description" = $3 WHERE "categories"."id" = $4  [["updated_at", "2024-05-03 17:26:39.502590"], ["name", "Shoes Update"], ["description", "All of Shoes update"], ["id", 6]]