app/controllers/api/v1/order_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."uid" = $1 LIMIT $2  [["uid", "dc01ea8d-ead1-4ad0-86aa-f5d6903e4ee0"], ["LIMIT", 1]]
---
  def paginate
    result, total_records, total_pages, per_page, page = @order_repo.fetch_paginate(
      per_page: params[:per_page] || 15,
      page: params[:page] || 1,
      sort_field: params[:sort_field] || 'id',
      sort_direction: params[:sort_direction] || 'DESC',
      filter: params
    )
    meta = { current_page: page, per_page: per_page, total_pages: total_pages, total_records: total_records }

    render json: ResponseFormatter.paginate("success", JSON.parse(result.to_json(include: [:customer])), meta, 200), status: :ok

INSERT INTO "orders" ("uid", "created_at", "updated_at", "customer_uid", "sub_total", "discount_total", "tax", "grand_total", "notes", "status", "payment_status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def store
    store_request = OrderStoreRequest.new(order_params)
    if store_request.valid?

      result, order = @order_service.create_order(order_params)