app/controllers/api/v1/product_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."uid" = $1 LIMIT $2  [["uid", "e30ace70-1170-47f9-b4ad-7b2d5a2979fb"], ["LIMIT", 1]]
---
  def paginate
    result, total_records, total_pages, per_page, page = @product_repo.fetch_paginate(
      per_page: params[:per_page] || 15,
      page: params[:page] || 1,
      sort_field: params[:sort_field] || 'id',
      sort_direction: params[:sort_direction] || 'DESC',
      filter: params
    )

    meta = { current_page: page, per_page: per_page, total_pages: total_pages, total_records: total_records }

    render json: ResponseFormatter.paginate("success", JSON.parse(result.to_json(include: :category)), meta, 200), status: :ok

UPDATE "products" SET "updated_at" = $1, "name" = $2 WHERE "products"."id" = $3  [["updated_at", "2024-05-04 07:13:44.917421"], ["name", "Sepatu 1 update"], ["id", 2]]
---
  def update
    update_request = ProductUpdateRequest.new(product_params)
    if update_request.valid?
      update_row = @product_repo.update_by_uid(params[:uid], product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def delete
    if @product_repo.delete_by_uid(params[:uid])