app/repositories/category_repository.rb

    def store(category_store_param)
        category = @db.new(category_store_param)
        category.uid = SecureRandom.uuid
        category.save
---
INSERT INTO "categories" ("uid", "created_at", "updated_at", "name", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["uid", "70e2a4a5-3f8a-43b2-9ea0-848cbd29f09b"], ["created_at", "2024-05-03 16:05:37.937370"], ["updated_at", "2024-05-03 16:05:37.937370"], ["name", "Jacket"], ["description", "All of Jacket"]]

    def update_by_uid(uid, attributes)
        category = Category.find_by(uid: uid)
        return false unless category

        category.update(attributes)
---
SELECT "categories".* FROM "categories" WHERE "categories"."uid" = $1 LIMIT $2  [["uid", "6c859131-5f79-4d67-9e55-9b5fd4451c03"], ["LIMIT", 1]]
UPDATE "categories" SET "updated_at" = $1, "name" = $2, "description" = $3 WHERE "categories"."id" = $4  [["updated_at", "2024-05-03 17:26:39.502590"], ["name", "Shoes Update"], ["description", "All of Shoes update"], ["id", 6]]