app/repositories/order_repository.rb

SELECT "customers".* FROM "customers" WHERE "customers"."uid" = $1  [["uid", "c1717892-7a7c-46b4-bd79-9ce4b4314c58"]]
SELECT "products".* FROM "products" WHERE "products"."uid" IN ($1, $2)  [["uid", "e53e9ce7-faa3-4239-bc54-770c286682bc"], ["uid", "56409864-0aaf-4ddf-a3ad-5e2ab15c0356"]]
---
  def get_by_uid_with_association(uid)
    @db.includes(:customer, :order_details => :product).find_by(uid: uid)